# ğŸ§° CCNA - Module 2: Basic Switch & End Device Configuration

## ğŸ¯ Objective  
Set up the **initial configuration** on switches and end devices: names, passwords, IP addresses, and basic connectivity â€” using Cisco IOS (CLI).

---

## 2.1 âš™ï¸ Cisco IOS Access

### ğŸ’» What is an OS?
All devices (PCs, switches, routers) need an **Operating System (OS)** to function.

- **Shell** â€“ The user interface (CLI or GUI)
- **Kernel** â€“ Communicates between software and hardware
- **Hardware** â€“ Physical components like CPU, memory, ports

### ğŸ–¼ï¸ CLI vs GUI

| Interface | Used For          | Examples           | Pros                     | Cons             |
|----------:|------------------|--------------------|--------------------------|------------------|
| **GUI**   | User interaction  | Windows, macOS     | Friendly, visual         | May crash/freeze |
| **CLI**   | Admin control     | Cisco IOS          | More stable, precise     | Steeper learning curve |

ğŸ“Œ *Cisco devices are mostly configured via CLI for stability and control.*

---

### ğŸ”Œ Access Methods

| Method   | Secure? | Use Case                                      |
|----------|--------|-----------------------------------------------|
| Console  | âœ…      | Direct physical connection (initial setup)    |
| SSH      | âœ…      | Encrypted remote CLI access                   |
| Telnet   | âŒ      | Insecure remote CLI (plaintext, legacy only)  |

### ğŸ§° Terminal Emulation Tools
- **PuTTY**
- **Tera Term**
- **SecureCRT**

---

## 2.2 ğŸ§­ IOS Navigation

### ğŸ” Command Modes

| Mode                  | Prompt         | Purpose                          |
|-----------------------|----------------|----------------------------------|
| User EXEC             | `>`            | Basic monitoring                 |
| Privileged EXEC       | `#`            | Full access                      |
| Global Configuration  | `(config)#`    | Device-wide settings             |
| Line Config           | `(config-line)#` | Console/VTY (SSH/Telnet) access |
| Interface Config      | `(config-if)#` | Interface (e.g. port) settings   |

### ğŸ”„ Mode Transitions

```bash
enable                    # User â†’ Privileged
configure terminal        # Privileged â†’ Global Config
line console 0            # Global â†’ Line Config
interface vlan 1          # Global â†’ Interface Config
exit                      # Go back one mode
end / Ctrl+Z              # Exit all config modes â†’ Privileged EXEC
```

---

## 2.3 ğŸ§± Command Structure

### ğŸ“ Syntax Rules

```
command [optional] {required} <argument>
```

- `bold` â†’ typed exactly as shown
- *italics* â†’ user-entered values
- `[ ]` â†’ optional
- `{ }` â†’ required
- `{x | y}` â†’ choose one

ğŸ“Œ Example:
```bash
ping 192.168.10.5
```

### ğŸ†˜ Help & Completion

- `?` â†’ shows available options
- `Tab` â†’ auto-completes command
- Command feedback helps correct syntax mistakes

---

### âš¡ Hotkeys & Shortcuts

| Key             | Function                                        |
|----------------|-------------------------------------------------|
| `Tab`          | Auto-complete command                          |
| `Up / Down`    | Scroll command history                         |
| `Ctrl + C`     | Abort command / return to exec mode            |
| `Ctrl + Z`     | End config mode â†’ Privileged EXEC              |
| `Ctrl + Shift + 6` | Break process (e.g., stop ping)           |
| `Space`        | Next screen when `--More--` appears            |
| `Enter`        | Next line when `--More--` appears              |

---

## 2.4 ğŸ–¥ï¸ Basic Device Configuration

### ğŸ·ï¸ Set Hostname

```bash
Switch(config)# hostname MySwitch
Switch(config)# no hostname         # Reset to default
```

### ğŸ”’ Set Passwords

#### Console Password (User EXEC)
```bash
Switch(config)# line console 0
Switch(config-line)# password cisco
Switch(config-line)# login
```

#### Privileged EXEC Password
```bash
Switch(config)# enable secret class
```

#### VTY Lines (SSH/Telnet)
```bash
Switch(config)# line vty 0 15
Switch(config-line)# password letmein
Switch(config-line)# login
```

ğŸ§  *Cisco switches usually support up to 16 VTY lines (0â€“15).*

### ğŸ” Encrypt Passwords
```bash
Switch(config)# service password-encryption
```

### ğŸ“¢ Banner Message

```bash
Switch(config)# banner motd # Unauthorized access is prohibited #
```

ğŸ“Œ The `#` is just a delimiter â€” use any non-conflicting character.

---

## 2.5 ğŸ’¾ Save Configurations

### ğŸ§  Running vs Startup Config

| File            | Location | Description                            |
|-----------------|----------|----------------------------------------|
| `running-config`| RAM      | Active config, lost on reboot          |
| `startup-config`| NVRAM    | Saved config, used on boot             |

### ğŸ§¾ Save Config

```bash
Switch# copy running-config startup-config
```

### ğŸ”„ Rollback Options

- Undo unsaved changes:
```bash
Switch# reload
```

- Erase saved config:
```bash
Switch# erase startup-config
Switch# reload
```

### ğŸ“ Save Config to Text File (Tera Term / PuTTY)

1. Start logging in terminal emulator
2. Run:
```bash
show running-config
```
3. Stop logging & save file

---

## 2.6 ğŸŒ Ports and Addresses

### ğŸŒ IP Addressing

| Type   | Bits | Format                  |
|--------|------|--------------------------|
| IPv4   | 32   | 192.168.1.1              |
| IPv6   | 128  | 2001:0db8:85a3::8a2e:... |

- **Subnet Mask** defines network vs host part
- **Default Gateway** allows internet routing

---

### ğŸ”Œ Interfaces & Media

Network media options:
- Twisted Pair (Ethernet)
- Fiber Optic
- Wireless
- Coaxial

Factors to consider:
- Speed and bandwidth
- Distance
- Environment
- Cost

---

## 2.7 âš™ï¸ Configure IP Addressing

### ğŸ§ Manual Config (Windows)

1. Control Panel â†’ Network Settings  
2. Adapter â†’ Properties  
3. Choose IPv4 â†’ Set:
   - IP address
   - Subnet mask
   - Default gateway

### ğŸ¤– Automatic via DHCP

1. Go to same place
2. Choose:
   - "Obtain IP address automatically"
   - "Obtain DNS automatically"

ğŸ§  IPv6 uses DHCPv6 and SLAAC (Stateless Auto Config)

---

### ğŸ§© Configure Switch Virtual Interface (SVI)

```bash
Switch(config)# interface vlan 1
Switch(config-if)# ip address 192.168.1.10 255.255.255.0
Switch(config-if)# no shutdown
```

ğŸ§  This gives your switch a management IP for SSH/remote access.

---

## 2.8 ğŸ” Verify Connectivity

### ğŸ“¡ Use `ping`

```bash
Switch# ping 192.168.1.100
```

- Success = IP, cables, and config all OK
- Failure? â†’ Check cabling, IPs, shutdown state

---


## ğŸ§  Quick Tips

- ğŸ” Use **SSH** not Telnet in real networks  
- ğŸ’¾ Always `copy run start` to save your config  
- ğŸ“¡ Set `no shutdown` on interfaces to bring them up  
- âš ï¸ Forgot a password? Youâ€™ll need to recover via console

---
